var publicQT = [{
    "type": "Q",
    "text": "1. 喜歡並且會看成人內容",
    "point": "5"
}, {
    "type": "Q",
    "text": "2. 拍過暴露/性愛照片",
    "point": "10"
}, {
    "type": "Q",
    "text": "3. 曾經有為了刺激而不穿內衣出門",
    "point": "15"
}, {
    "type": "Q",
    "text": "4. 購置過成人玩具給自己用",
    "point": "20"
}, {
    "type": "Q",
    "text": "5. 主動勾引過同性/異性",
    "point": "10"
}, {
    "type": "Q",
    "text": "6. 勾引過有伴侶的同性/異性",
    "point": "20"
}, {
    "type": "Q",
    "text": "7. 喜歡和陌生人發生肌膚接觸",
    "point": "15"
}, {
    "type": "Q",
    "text": "8. 喜歡著裝暴露/裸體時感受到他人的視線",
    "point": "10"
}, {
    "type": "Q",
    "text": "9. 能夠接受和陌生人發生性關係",
    "point": "20"
}, {
    "type": "Q",
    "text": "10. 在公共場所盯過陌生人的下體",
    "point": "15"
}, {
    "type": "Q",
    "text": "11. 喜歡撫摸同性/異性的私處",
    "point": "20"
}, {
    "type": "Q",
    "text": "12. 幻想過被強姦/輪姦等非普通的色情場警",
    "point": "20"
}, {
    "type": "L",
    "text": "13. 幻想過發生過關係的對象有......（多選）",
    "point": ""
}, {
    "type": "LQ",
    "text": "．好友/網友",
    "point": "15"
}, {
    "type": "LQ",
    "text": "．親人/親戚/閨蜜的另一半/陌生人",
    "point": "20"
}, {
    "type": "L",
    "text": "14. 曾經非常淡定的和......聊起大尺度色情內容（多選）",
    "point": ""
}, {
    "type": "LQ",
    "text": "．好友/網友/另一半",
    "point": "10"
}, {
    "type": "LQ",
    "text": "．親人/閨蜜",
    "point": "15"
}, {
    "type": "LQ",
    "text": "．長輩/晚輩/陌生人",
    "point": "20"
}, {
    "type": "Q",
    "text": "15. 會對他人的衣物/氣味/用過的物件而逞生興奮感",
    "point": "15"
}, {
    "type": "Q",
    "text": "16. 你是BDSM圈子的人",
    "point": "20"
}, {
    "type": "T",
    "text": "平日指數",
    "point": ""
}]

var privateQT = [{
    "type": "L",
    "text": "17. 每週平均自慰......（單選）",
    "point": ""
}, {
    "type": "LQ",
    "text": "．2次",
    "point": "5"
}, {
    "type": "LQ",
    "text": "．3次",
    "point": "10"
}, {
    "type": "LQ",
    "text": "．4次或以上",
    "point": "20"
}, {
    "type": "Q",
    "text": "18. 有約炮經驗（單選）",
    "point": "10"
}, {
    "type": "L",
    "text": "19. 在......自願破處（單選）",
    "point": ""
}, {
    "type": "LQ",
    "text": "．18歲",
    "point": "5"
}, {
    "type": "LQ",
    "text": "．17歲",
    "point": "10"
}, {
    "type": "LQ",
    "text": "．16歲",
    "point": "15"
}, {
    "type": "LQ",
    "text": "．15歲或之前",
    "point": "20"
}, {
    "type": "Q",
    "text": "20. 超過2個洞或以上都被開發過",
    "point": "15"
}, {
    "type": "L",
    "text": "21. 有過......的性愛/調教經驗（單選）",
    "point": ""
}, {
    "type": "LQ",
    "text": "．2個人",
    "point": "5"
}, {
    "type": "LQ",
    "text": "．3個人",
    "point": "10"
}, {
    "type": "LQ",
    "text": "．4個人或以上",
    "point": "20"
}, {
    "type": "Q",
    "text": "22. 有過在室外的性愛/調教經驗",
    "point": "10"
}, {
    "type": "Q",
    "text": "23. 有過文愛/語愛/視愛經驗",
    "point": "10"
}, {
    "type": "Q",
    "text": "24. 打電話/和朋友逛街/做正經事等時候發生過色情的事",
    "point": "15"
}, {
    "type": "Q",
    "text": "25. 給自己的另一半戴過綠帽",
    "point": "20"
}, {
    "type": "Q",
    "text": "26. 在非床鋪或卧室的地方自慰過",
    "point": "15"
}, {
    "type": "Q",
    "text": "27. 在做愛的時候心裡幻想過其他人",
    "point": "20"
}, {
    "type": "Q",
    "text": "28. 已有另一半但是還是想和其他人發生親密關係",
    "point": "20"
}, {
    "type": "L",
    "text": "29. 曾經一週內有與......不同的人發生性關係（單選）",
    "point": ""
}, {
    "type": "LQ",
    "text": "．2個",
    "point": "10"
}, {
    "type": "LQ",
    "text": "．3個",
    "point": "15"
}, {
    "type": "LQ",
    "text": "．4個或以上",
    "point": "20"
}, {
    "type": "Q",
    "text": "30. 有過多P的經驗",
    "point": "15"
}, {
    "type": "Q",
    "text": "31. 喜歡喝下他人或自己的液體",
    "point": "10"
}, {
    "type": "Q",
    "text": "32. 喜歡揪或者被揪頭髮掐脖子",
    "point": "10"
}, {
    "type": "Q",
    "text": "33. 喜歡給予或者接受言語上的辱罵羞辱",
    "point": "20"
}, {
    "type": "Q",
    "text": "34. 喜歡言語上主動羞辱自己（如：我是你的母狗/公狗）",
    "point": "15"
}, {
    "type": "Q",
    "text": "35. 享受被叫或者是叫\"主人\"等羞恥稱呼",
    "point": "15"
}, {
    "type": "Q",
    "text": "36. 願意給/看現實中沒有見過面的網友呻吟，羞恥的照片/視頻",
    "point": "20"
}, {
    "type": "Q",
    "text": "37. 看完/填完這個紫評表後，身體有了感覺",
    "point": "20"
}, {
    "type": "T",
    "text": "私下指數",
    "point": ""
}]
