var publicQS = [{
    "type": "Q",
    "text": "1. 喜欢并且会看成人内容",
    "point": "5"
}, {
    "type": "Q",
    "text": "2. 拍过暴露/性爱照片",
    "point": "10"
}, {
    "type": "Q",
    "text": "3. 曾经有为了刺激而不穿内衣出门",
    "point": "15"
}, {
    "type": "Q",
    "text": "4. 购置过成人玩具给自己用",
    "point": "20"
}, {
    "type": "Q",
    "text": "5. 主动勾引过同性/异性",
    "point": "10"
}, {
    "type": "Q",
    "text": "6. 勾引过有伴侣的同性/异性",
    "point": "20"
}, {
    "type": "Q",
    "text": "7. 喜欢和陌生人发生肌肤接触",
    "point": "15"
}, {
    "type": "Q",
    "text": "8. 喜欢着装暴露/裸体时感受到他人的视线",
    "point": "10"
}, {
    "type": "Q",
    "text": "9. 能够接受和陌生人发生性关係",
    "point": "20"
}, {
    "type": "Q",
    "text": "10. 在公共场所盯过陌生人的下体",
    "point": "15"
}, {
    "type": "Q",
    "text": "11. 喜欢抚摸同性/异性的私处",
    "point": "20"
}, {
    "type": "Q",
    "text": "12. 幻想过被强姦/轮姦等非普通的色情场警",
    "point": "20"
}, {
    "type": "L",
    "text": "13. 幻想过发生过关係的对象有......（多选）",
    "point": ""
}, {
    "type": "LQ",
    "text": "．好友/网友",
    "point": "15"
}, {
    "type": "LQ",
    "text": "．亲人/亲戚/闺蜜的另一半/陌生人",
    "point": "20"
}, {
    "type": "Q",
    "text": "14. 会对他人的衣物/气味/用过的物件而逞生兴奋感",
    "point": "15"
}, {
    "type": "Q",
    "text": "15. 你是BDSM圈子的人",
    "point": "20"
}, {
    "type": "T",
    "text": "平日指数",
    "point": ""
}]

var privateQS = [{
    "type": "L",
    "text": "16. 每週平均自慰......（单选）",
    "point": ""
}, {
    "type": "LQ",
    "text": "．2次",
    "point": "5"
}, {
    "type": "LQ",
    "text": "．3次",
    "point": "10"
}, {
    "type": "LQ",
    "text": "．4次或以上",
    "point": "20"
}, {
    "type": "Q",
    "text": "17. 有约炮经验（单选）",
    "point": "10"
}, {
    "type": "L",
    "text": "18. 在......自愿破处（单选）",
    "point": ""
}, {
    "type": "LQ",
    "text": "．18岁",
    "point": "5"
}, {
    "type": "LQ",
    "text": "．17岁",
    "point": "10"
}, {
    "type": "LQ",
    "text": "．16岁",
    "point": "15"
}, {
    "type": "LQ",
    "text": "．15岁或之前",
    "point": "20"
}, {
    "type": "Q",
    "text": "19. 超过2个洞或以上都被开发过",
    "point": "15"
}, {
    "type": "L",
    "text": "20. 有过......的性爱/调教经验（单选）",
    "point": ""
}, {
    "type": "LQ",
    "text": "．2个人",
    "point": "5"
}, {
    "type": "LQ",
    "text": "．3个人",
    "point": "10"
}, {
    "type": "LQ",
    "text": "．4个人或以上",
    "point": "20"
}, {
    "type": "Q",
    "text": "21. 有过在室外的性爱/调教经验",
    "point": "10"
}, {
    "type": "Q",
    "text": "22. 有过文爱/语爱/视爱经验",
    "point": "10"
}, {
    "type": "Q",
    "text": "23. 打电话/和朋友逛街/做正经事等时候发生过色情的事",
    "point": "15"
}, {
    "type": "Q",
    "text": "24. 给自己的另一半戴过绿帽",
    "point": "20"
}, {
    "type": "Q",
    "text": "25. 在非床铺或卧室的地方自慰过",
    "point": "15"
}, {
    "type": "Q",
    "text": "26. 在做爱的时候心裡幻想过其他人",
    "point": "20"
}, {
    "type": "Q",
    "text": "27. 已有另一半但是还是想和其他人发生亲密关係",
    "point": "20"
}, {
    "type": "L",
    "text": "28. 曾经一週内有与......不同的人发生性关係（单选）",
    "point": "10"
}, {
    "type": "LQ",
    "text": "．2个",
    "point": "10"
}, {
    "type": "LQ",
    "text": "．3个",
    "point": "15"
}, {
    "type": "LQ",
    "text": "．4个或以上",
    "point": "20"
}, {
    "type": "Q",
    "text": "29. 有过多P的经验",
    "point": "15"
}, {
    "type": "Q",
    "text": "30. 喜欢喝下他人或自己的液体",
    "point": "10"
}, {
    "type": "Q",
    "text": "31. 喜欢揪或者被揪头髮掐脖子",
    "point": "10"
}, {
    "type": "Q",
    "text": "32. 喜欢给予或者接受言语上的辱骂羞辱",
    "point": "20"
}, {
    "type": "Q",
    "text": "33. 喜欢言语上主动羞辱自己（如：我是你的母狗/公狗）",
    "point": "15"
}, {
    "type": "Q",
    "text": "34. 享受被叫或者是叫\"主人\"等羞耻称呼",
    "point": "15"
}, {
    "type": "Q",
    "text": "35. 愿意给/看现实中没有见过面的网友呻吟，羞耻的照片/视频",
    "point": "20"
}, {
    "type": "Q",
    "text": "36. 看完/填完这个紫评表后，身体有了感觉",
    "point": "20"
}, {
    "type": "T",
    "text": "私下指数",
    "point": ""
}]
